<?php
/*
 * 测试用例
 * */

require_once '../../autoload.php';

//大乐透
//单式
//$res = Lottery\LotteryHelper::win(111, [['03','09','15','18','26'],['06','12']],[['04','09','17','18','27'],['06','12']]);
//复式
//$res = Lottery\LotteryHelper::win(112, [['03','09','15','18','26'],['06','12']],[['04','09','17','18','27','33'],['06','11','12']]);
//胆拖
//$res = Lottery\LotteryHelper::win(113, [['03','09','15','18','26'],['06','12']],[['04','09','27','33'],['17','18','19'],['06'],['11','12']]);


//七星彩
//单式
//$res = Lottery\LotteryHelper::win(121, [1,2,3,4,5,6,7],[1,2,0,7,1,6,7]);
//复式
//$res = Lottery\LotteryHelper::win(122, [1,2,3,4,5,6,7],[[1,2],[2,4],[3,0],[7,8,9],[1],[8],[0]]);

//排列3
//直选单式
//$res = Lottery\LotteryHelper::win(121, [1,2,3,4,5,6,7],[1,2,0,7,1,6,7]);3
//直选复式
//$res = Lottery\LotteryHelper::win(121, [1,2,3],[[1],[2,3],[3,4]]);

//双色球
//单式
//$res = Lottery\LotteryHelper::win(211, [['01','02','03','04','05','06'],['07']], [['03','04','05','06','07','08'],['07']]);
//复式
//$res = Lottery\LotteryHelper::win(212, [['01','02','03','04','05','06'],['07']], [['03','04','05','06','07','08','09'],['07','15']]);
//胆拖
//$res = Lottery\LotteryHelper::win(213, [['01','02','03','04','05','06'],['07']], [['01','03','08','09'],['02','04','10','18'],['07','16']]);

//福彩3D
//单选单式
//$res = Lottery\LotteryHelper::win(221, [1,2,3],[1,2,3]);
//单选单复式
//$res = Lottery\LotteryHelper::win(222, [5,2,3],[2,3,5]);
//单选双复式
//$res = Lottery\LotteryHelper::win(223, [1,2,2],[1,2]);
//单选全复式
//$res = Lottery\LotteryHelper::win(224, [2,2,2],[1,2,3,4,5]);
//组选3单式
//$res = Lottery\LotteryHelper::win(225, [3,2,2],[3,2]);
//组选3复式
//$res = Lottery\LotteryHelper::win(226, [4,5,4],[1,2,4,5]);
//组选6单式
//$res = Lottery\LotteryHelper::win(227, [2,3,1],[1,2,3]);
//组选6复式
//$res = Lottery\LotteryHelper::win(228, [2,3,1],[1,2,3,4,5]);

var_dump($res);